-- классы
INSERT INTO ordo
(name_ordo, name_ordo_english, name_ordo_latin, description_ordo)
VALUES
('ГАГАРЫ', '', 'GAVHFORMES', 'Крупные водоплавающие птицы с удлиненным валькова- тым туловищем, длинной шеей и прямым кинжалообразным клювом. На далеко отставленных назад ногах четыре пальца, из которых один слабо развит и мал, а остальные соединены плавательной перепонкой.'),
('ПОГАНКИ', '', 'PODICIPEDIFORMES', 'По общему складу тела и форме клюва поганки напоминают гагар, но отличаются от них меньшей величиной и особым строением пальцев, которые не соединены плавательной перепонкой, а оторочены кожистыми лопастями.'),
('ВЕСЛОНОГИЕ', '', 'PELICANIFORMES', 'Птицы преимущественно средних и крупных размеров. Их распространение и распределение по территории связано с водной средой. Характерной чертой птиц этого отряда является то, что все четыре пальца соединены общей плавательной перепонкой. За немногими исключениями это обитатели южных широт.'),
('ГОЛЕНАСТЫЕ или АИСТООБРАЗНЫЕ', '', 'CICONIIFORMES', 'В основном это птицы крупных и средних размеров. Жизнь большинства из них тесно связана с водоемами, особенно с мелководьями, богатыми водной и околоводной растительностью. Охотой на водных животных, позвоночных и беспозвоночных, объясняются и характерные черты строения — пальцы ног и сами ноги, шея и клюв птиц удлинены. Часть птиц (колпицы, фламинго) живут колониями; выпи и аисты гнездятся отдельными парами, причем последние— далеко от водоемов.'),
('ПЛАСТИНЧАТОКЛЮВЫЕ (ГУСЕОБРАЗНЫЕ)', '', 'ANSERIFORMES', 'Птицы крупных и средних размеров, с длинной шеей и кожистой плавательной перепонкой между тремя передними пальцами ног. Оперение плотное, жесткое, под ним лежит густой пух, обеспечивающий, вместе с толстым слоем подкожного жира, надежную теплоизоляцию. Имеется хорошо развитая копчиковая железа, выделениями которой смазываются перья, благодаря чему они не намокают. Клюв удлиненный, уплощенный сверху вниз (кроме крохалей) и усажен по краям тонкими роговыми пластинками или зубчиками, на конце надклювья — «ноготок». Роговые пластинки образуют своеобразный цедильный аппарат, через который птицы пропускают захваченную в рот вместе с пищей воду, а зубчики нужны для удержания пойманной рыбы и других животных.'),
('ХИЩНЫЕ ПТИЦЫ', '', 'FALCQNIFORMES', 'Это птицы крупных и средних размеров. Все хищные птицы отличаются достаточно мощными ногами с загнутыми острыми когтями и крючковатым клювом.'),
('КУРИНЫЕ', '', 'GALLIFORMES', 'Птицы этого отряда имеют плотное сложение, закругленные, сравнительно короткие крылья, большие и сильные ноги с крепкими тупыми когтями, приспособленными для разгребания земли и прелых листьев. Клюв короткий и сильный, «зерноядного» типа. Оперение плотное и жесткое. Во внутреннем строении характерно развитие зоба, мускульного желудка и слепых отростков кишок, что связано с потреблением грубой растительной пищи.'),
('ЖУРАВЛЕОБРАЗНЫЕ', '', 'GRUIFORMES', ''),
('РЖАНКООБРАЗНЫЕ', '', 'CHARADR1IFORMES', ' Внутреннее строение всех этих птиц указывает на их несомненное родство, но внешние признаки настолько разнообразны, что дать их более или менее общее описание затруднительно.'),
('ГОЛУБЕОБРАЗНЫЕ', '', 'COLUMBIFORMES', ''),
('КУКУШКООБРАЗНЫЕ', '', 'UCULIFORMES', ''),
('СОВЫ', '', 'STRJGIFORMES', 'Птицы крупных и средних размеров, хорошо приспособленные к ночному образу жизни. Рыхлое мягкое перо и закругленность маховых перьев крыла делают полет сов практически бесшумным. Это позволяет им незаметно подлетать к жертве. Способность поворачивать голову на 270°, направленные вперед глаза, крупные ушные отверстия помогают отыскивать добычу, не делая лишних движений. Оперенные ноги — короткие, сильные, с мощными относительно длинными острыми когтями. Четвертый палец на лапах сов может поворачиваться вбок и назад, благодаря чему они надежно захватывают и удерживают свою жертву. Вооружение этих хищников дополняется сильным, крючкообразно загнутым клювом, основание которого обрастает кожей. Пища сов— мелкие млекопитающие и птицы. Мелкие совы, кроме того, могут кормиться и насекомыми'),
('КОЗОДОЕОБРАЗНЫЕ', '', 'CAPRIMULGIFORMES', ''),
('РАКШЕОБРАЗНЫЕ', '', 'CORACSEFORMES', ''),
('СТРИЖЕОБРАЗНЫЕ', '', 'APODIFORMES ', ''),
('ДЯТЛООБРАЗНЫЕ', '', 'PICIFORMES', 'К отряду дятлообразных относятся некрупные птицы с жестким оперением, короткими крыльями и ногами, сильным, прямым долотообразным клювом. Характерным признаком дятлообразных является расположение пальцев: два направлены вперед, два — назад. Такое строение лап увеличивает площадь опоры и наиболее удобно при лазании по вертикальным стволам деревьев. Этой же цели у дятлообразных служит хвост с очень твердыми, упругими стержнями рулевых перьев.'),
('ВОРОБЬИНЫЕ', '', ' PASSERIFORMES', 'К отряду воробьиных относятся птицы мелкой и средней величины. Внешне воробьиные очень разнообразны. Клювы их разной формы, но чаще всего прямые, умеренной длины. Оперение бывает и рыхлым, и плотным. Окраска его варьирует в широких пределах.');

-- IUCN Red List of Threatened Animals
INSERT INTO red_book_IUCN
(security_statuses, description_class, description_class_english)
VALUES
('EX', 'Исчезнувшие', 'Extinct'),
('EW', 'Исчезнувшие в дикой природе', 'Extinct in the Wild,'),
('CR', 'Находящие на грани полного исчезновения', 'Critically Endangered'),
('EN', 'Исчезающие', 'Endangered'),
('VU', 'Уязвимые', 'Vulnerable'),
('NT', 'Находящиеся в состоянии, близком к угрожаемому', 'Near Threatened'),
('LC', 'Вызывающие наименьшие опасения', 'Least Concern'),
('DD', 'Недостаток данных', 'Data Deficient'),
('NE', 'Неоценённые', 'Not Evaluated');


-- классы по Красной книге РФ
INSERT INTO red_book_rf
(security_statuses, description_class)
VALUES
(0, 'Вероятно исчезнувшие'),
(1, 'Находящиеся под угрозой исчезновения'),
(2, 'Сокращающиеся в численности и/или распространении'),
(3, 'Редкие'),
(5, 'Неопределенные по статусу'),
(5, 'Восстанавливаемые и восстанавливающиеся')
;


-- наименование видов пищи
INSERT INTO food_name
(name, description_species)
VALUES
('рыба', ''),
('моллюски', ''),
('насекомые', ''),
('водные растения', ''),
('болотные растения', ''),
('наземные растения', ''),
('культурные злаковые', '')
;

-- суммирует виды пищи для вида птицы в один сезон
INSERT INTO food_sum
(food_1, food_2, food_3, food_4, food_5, food_6, food_7)
VALUES
(1, 2, 3, null, null, null, null),
(3, 4, NULL, null, null, null, null),
(4, 5, 6, null, null, null, null),
(4, 5, 6, 7, null, null, null),
(3, 4, 5, null, null, null, null)
;


-- виды пищи по сезонам
INSERT INTO food
(winter, spring, summer, autumn)
VALUES
(NULL, 1, 1, 1),
(NULL, 2, 2, 2),
(NULL, 3, 3, 4),
(NULL, 5, 5, 5)
;



-- виды
INSERT INTO profiles
(name, name_latin, name_english, description_species, ordo_id, food, weight_unit, length_unit, red_book)
VALUES
('чернозобая гагара', 'Gavia arctica L.', '', 'Жизнь гагар неразрывно связана с водоемом. Они прекрасно плавают и ныряют, оставаясь под водой до трех минут. На суше же гагары беспомощны, ходить совсем не могут и передвигаются ползком, лежа на груди и отталкиваясь лапами и крыльями. В брачный период гагары издают протяжный, стонущий крик, похожий на плач ребенка или скрип дерева, а, подзывая птенцов, каркают, как вороны, или кричат «га-га- гагарра».', 1, 1, 3, null, null),
('краснозобая гагара', 'G. sfeiiafa Pont', '', 'Жизнь гагар неразрывно связана с водоемом. Они прекрасно плавают и ныряют, оставаясь под водой до трех минут. На суше же гагары беспомощны, ходить совсем не могут и передвигаются ползком, лежа на груди и отталкиваясь лапами и крыльями. В брачный период гагары издают протяжный, стонущий крик, похожий на плач ребенка или скрип дерева, а, подзывая птенцов, каркают, как вороны, или кричат «га-га- гагарра».', 1, 1, 2, NULL, NULL),
('большая поганка, или чомга', 'Podiceps crlsfaius L.', '', 'Чомга характеризуется крупными размерами, беловатой спереди шеей, темной черновато-бурой окраской спины и наличием «воротничка» из удлиненных, ржавого цвета перьев, обрамляющих бока головы и затылок; на затылке торчат два черных хохолка, образующих «рожки», которые сливаются с «воротничком».', 2, 1, 1.5, NULL, NULL),
('серощекая поганка', 'P. griseigena Bodd', '', 'Серощекая поганка несколько мельче чомги (вес до 0,7 кг). «Воротник» и хохолок у нее развиты слабо. Бока и передняя сторона шеи рыжие, щеки и низ головы дымчато-серые.', 2, 1, 0.7, NULL, NULL),
('рогатая, или красношейная поганка', 'P. aurifus L.', '', 'Рогатая поганка значительно мельче предыдущих видов (вес до 0,5 кг). Передняя сторона шеи, зоб и бока яркорыжие, на голове черный «воротник» и рыжеватые «рожки»; от клюва к ушам идут светло-рыжие полоски, верх тела, крылья и голова черные.', 2, 1, 0.5, NULL, NULL),
('розовый пеликан', 'Pelicanus onocrotalus L', '', '', 3, NULL, NULL, NULL, NULL),
('большой баклан', 'Phalacrocorax carbo ', '', '', 3, NULL, NULL, NULL, NULL),
('выпь', 'Botaurus stellaris L.', '', 'Окраска оперения выпи настолько сливается с окружающим фоном, что заметить затаившуюся в тростниках птицу трудно даже с очень близкого расстояния.', 4, NULL, NULL, NULL, NULL),
('серая цапля', 'Ardea cinerea L.', '', '', 4, NULL, NULL, NULL, NULL),
('Лебедь-кликун', 'Cygnus cygnus L.', '', 'Ниболее крупная (до 13 кг весом) и самая красивая птица из отряда пластинчатоклювых. Оперение снежно-белое. Клюв ровный, без вздутия и наростов. Основание его желтое, конец черный. Молодые птицы отличаются сероватым цветом оперения', 5, 2, 15, NULL, NULL),
('гуменник', 'A. tabalis Lath', '', 'у гуменника клюв черный, с желтым или оранжевым пояском посередине', 5, 3, NULL, NULL, NULL),
('Кряква', 'Anas platyrhynchos L.', '', 'По внешнему виду и окраске кряква похожа на обычную домашнюю утку,  Летящая кряква отличается от других уток светлым низом крыльев, белой полоской, окаймляющей ярко-фиолетовое крыловое зеркальце, и характерным посвистом («вить-вить-вить-вить»), который производят крылья, рассекающие воздух. Как и другие «благородные» (речные) утки, кряквы хорошо плавают, но плохо ныряют, поэтому кормятся преимущественно на мелководных участках водоемов, а иногда и на берегу.', 5, 4, 1.5, NULL, NULL)
;


-- яйца
INSERT INTO eggs
(id_profiles, description_species, size_egg_leg, size_egg_width )
VALUES
(1, 'буровато-зеленое с темно-бурыми пятнами', 83, 53),
(2, 'буровато-зеленое с темно-бурыми пятнами', 83, 53),
(3, 'одоцветных, бледно-зеленоватых или желтоватых яиц', NULL, NULL),
(4, 'одоцветных, бледно-зеленоватых или желтоватых яиц', NULL, NULL),
(5, 'одоцветных, бледно-зеленоватых или желтоватых яиц', NULL, NULL),
(8, 'оливково-коричневых', NULL, NULL),
(10, ' белого или сероватого цвета', 110, 75),
(11, 'белых, иногда с зеленоватым налетом', 85, 60),
(12, 'светлых, зеленоватооливковых', 57, 40)
;

-- гнезда
INSERT INTO nest
(id_profiles, description_species, size_nest)
VALUES
(1, 'Гнездо — небольшая ямка со скудной растительной выстилкой или без нее. Гнезда устраивают на пологом берегу у самой воды, так что при опасности гагара прямо соскальзывает в воду', NULL),
(2, 'Гнездо — небольшая ямка со скудной растительной выстилкой или без нее. Гнезда устраивают на пологом берегу у самой воды, так что при опасности гагара прямо соскальзывает в воду', NULL),
(3, ' Гнездо устраивают чаще на воде, в прибрежных uipocm ix тростника или осок. Оно представляет собой большую плавающую кучу из тонких ивовых веточек, стеб - лей тростника, рогоза и других болотных растений.', NULL),
(4, ' Гнездо устраивают чаще на воде, в прибрежных uipocm ix тростника или осок. Оно представляет собой большую плавающую кучу из тонких ивовых веточек, стеб - лей тростника, рогоза и других болотных растений.', NULL),
(5, ' Гнездо устраивают чаще на воде, в прибрежных uipocm ix тростника или осок. Оно представляет собой большую плавающую кучу из тонких ивовых веточек, стеб - лей тростника, рогоза и других болотных растений.', NULL),
(8, 'Гнезда размещаются на кочках среди густой растительности, у края воды', null),
(10, '', NULL),
(11, ' Гнездо располагается на берегу или на iтопающих островках тростника и представляет собой до- иольно высокую рыхлую кучу, сложенную из стеблей и листьев болотных растений. На вершине кучи-—лоток, обильно выстланный перьями и пухом.', NULL),
(12, 'Гнездо располагается обычно вблизи воды, на сухом берегу или кочке. По периферии его кряква устраивает бортики из пуха и мелких перьев, иногда пухом устилает и иось лоток.', NULL)
;

-- размножение
INSERT INTO reproduction
(reproduction_id, data_start_nest, len_incubation_eggs, count_eggs, egg_id, nest_id, date_start_fly_nestling, age)
VALUES
(1, '10.05', 29, 2, 1, 1, '25.07', 1.5),
(2, '10.05', 29, 2, 2, 1, '25.07', 1.5),
(3, '10.05', 30, 6, 3, 3, '10.08', 2),
(4, '10.05', 30, 6, 3, 3, '10.08', 2),
(5, '10.05', 30, 6, 3, 3, '10.08', 2),
(8, NULL, 26, 6, 6, 6, null, 2),
(10, '01.05', 40, 6, 7, 7, '', null),
(11, '01.05', 30, 6, 8, 8, '01.08', null),
(12, '10.05', 27, 9, 9, 9, '01.08', 2)
;

INSERT INTO type_medio
(name)
VALUES
('foto'),
('video');
